
## Plan Result

[CI link](https://github.com/malachowski-labs/infrastructure/actions/runs/21650679865)


<pre><code>Plan: 57 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * argocd_application.cluster_config
  * argocd_application.traefik
  * cloudflare_dns_record.this
  * cloudflare_dns_record.wildcard
  * google_iam_workload_identity_pool.kubernetes
  * google_iam_workload_identity_pool_provider.kubernetes_oidc
  * google_project_iam_member.external_secrets_secret_accessor
  * google_service_account.external_secrets
  * google_service_account_iam_member.workload_identity_binding
  * hcloud_load_balancer.this
  * hcloud_load_balancer_network.this
  * hcloud_load_balancer_service.this
  * hcloud_load_balancer_target.this
  * helm_release.argocd
  * helm_release.external_secrets
  * kubectl_manifest.secret_store_gcp
  * kubernetes_config_map_v1.oidc_discovery
  * kubernetes_config_map_v1.oidc_nginx_config
  * kubernetes_deployment_v1.oidc_discovery
  * kubernetes_ingress_v1.oidc_discovery
  * kubernetes_namespace_v1.argocd
  * kubernetes_namespace_v1.external_secrets
  * kubernetes_namespace_v1.oidc_discovery
  * kubernetes_secret_v1.argocd_repo_access
  * kubernetes_service_account_v1.external_secrets
  * kubernetes_service_v1.oidc_discovery
  * module.talos.hcloud_firewall.this[0]
  * module.talos.hcloud_network.this
  * module.talos.hcloud_network_subnet.nodes
  * module.talos.hcloud_placement_group.control_plane
  * module.talos.hcloud_placement_group.worker
  * module.talos.hcloud_primary_ip.control_plane_ipv4[0]
  * module.talos.hcloud_server.control_planes[&#34;control-plane-1&#34;]
  * module.talos.hcloud_ssh_key.this
  * module.talos.kubectl_manifest.apply_cilium[&#34;/api/v1/namespaces/kube-system/configmaps/cilium-config&#34;]
  * module.talos.kubectl_manifest.apply_cilium[&#34;/api/v1/namespaces/kube-system/configmaps/cilium-envoy-config&#34;]
  * module.talos.kubectl_manifest.apply_cilium[&#34;/api/v1/namespaces/kube-system/serviceaccounts/cilium&#34;]
  * module.talos.kubectl_manifest.apply_cilium[&#34;/api/v1/namespaces/kube-system/serviceaccounts/cilium-envoy&#34;]
  * module.talos.kubectl_manifest.apply_cilium[&#34;/api/v1/namespaces/kube-system/serviceaccounts/cilium-operator&#34;]
  * module.talos.kubectl_manifest.apply_cilium[&#34;/api/v1/namespaces/kube-system/services/cilium-envoy&#34;]
  * module.talos.kubectl_manifest.apply_cilium[&#34;/apis/apps/v1/namespaces/kube-system/daemonsets/cilium&#34;]
  * module.talos.kubectl_manifest.apply_cilium[&#34;/apis/apps/v1/namespaces/kube-system/daemonsets/cilium-envoy&#34;]
  * module.talos.kubectl_manifest.apply_cilium[&#34;/apis/apps/v1/namespaces/kube-system/deployments/cilium-operator&#34;]
  * module.talos.kubectl_manifest.apply_cilium[&#34;/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/cilium&#34;]
  * module.talos.kubectl_manifest.apply_cilium[&#34;/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/cilium-operator&#34;]
  * module.talos.kubectl_manifest.apply_cilium[&#34;/apis/rbac.authorization.k8s.io/v1/clusterroles/cilium&#34;]
  * module.talos.kubectl_manifest.apply_cilium[&#34;/apis/rbac.authorization.k8s.io/v1/clusterroles/cilium-operator&#34;]
  * module.talos.kubectl_manifest.apply_cilium[&#34;/apis/rbac.authorization.k8s.io/v1/namespaces/kube-system/rolebindings/cilium-config-agent&#34;]
  * module.talos.kubectl_manifest.apply_cilium[&#34;/apis/rbac.authorization.k8s.io/v1/namespaces/kube-system/roles/cilium-config-agent&#34;]
  * module.talos.kubectl_manifest.apply_hcloud_ccm[&#34;/api/v1/namespaces/kube-system/serviceaccounts/hcloud-cloud-controller-manager&#34;]
  * module.talos.kubectl_manifest.apply_hcloud_ccm[&#34;/apis/apps/v1/namespaces/kube-system/deployments/hcloud-cloud-controller-manager&#34;]
  * module.talos.kubectl_manifest.apply_hcloud_ccm[&#34;/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/system:hcloud-cloud-controller-manager:restricted&#34;]
  * module.talos.kubectl_manifest.apply_hcloud_ccm[&#34;/apis/rbac.authorization.k8s.io/v1/clusterroles/system:hcloud-cloud-controller-manager&#34;]
  * module.talos.talos_cluster_kubeconfig.this[0]
  * module.talos.talos_machine_bootstrap.this[0]
  * module.talos.talos_machine_secrets.this
  * module.talos.tls_private_key.ssh_key[0]


<details><summary>Change Result (Click me)</summary>

:warning: **The content is omitted as it is too long.** :warning:

```hcl

  # data.kubernetes_secret_v1.argo_cluser_password will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "kubernetes_secret_v1" "argo_cluser_password" {
      + data      = (sensitive value)
      + id        = (known after apply)
      + immutable = (known after apply)
      + type      = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "argocd-initial-admin-secret"
          + namespace        = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # argocd_application.cluster_config will be created
  + resource "argocd_application" "cluster_config" {
      + cascade  = true
      + id       = (known after apply)
      + status   = (known after apply)
      + validate = true
      + wait     = false

      + metadata {
          + generation       = (known after apply)
          + name             = "cluster-config"
          + namespace        = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + project                = "default"
          + revision_history_limit = 10

          + destination {
              + server = "https://kubernetes.default.svc"
            }

          + source {
              + path            = "clusters/prod.malachowski.me"
              + repo_url        = "https://github.com/malachowski-labs/manifests"
              + target_revision = "HEAD"

              + directory {
                  + recurse = true
                }
            }

          + sync_policy {
              + sync_options = [
                  + "ServerSideApply=true",
                  + "CreateNamespace=true",
                ]

              + automated {
                  + prune     = true
                  + self_heal = true
                }
            }
        }
    }

  # argocd_application.traefik will be created
  + resource "argocd_application" "traefik" {
      + cascade  = true
      + id       = (known after apply)
      + status   = (known after apply)
      + validate = true
      + wait     = true

      + metadata {
          + generation       = (known after apply)
          + name             = "argo-traefik-chart"
          + namespace        = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + project                = "default"
          + revision_history_limit = 10

          + destination {
              + server = "https://kubernetes.default.svc"
            }

          + source {
              + path            = "traefik"
              + repo_url        = "https://github.com/traefik/traefik-helm-chart.git"
              + target_revision = "v38.0.2"

              + helm {
                  + values = <<-EOT
                        logs:
                                    general:
                                      level: INFO
                                    access:
                                      enabled: true
                                  service:
                                    annotations:
                                      load-balancer.hetzner.cloud/location: hel1
                                      load-balancer.hetzner.cloud/name: prod-malachowski-me-lb
                    EOT
                }
            }

          + sync_policy {
              + sync_options = [
                  + "CreateNamespace=true",
                ]

              + automated {
                  + prune     = true
                  + self_heal = true
                }
            }
        }
    }

  # cloudflare_dns_record.this will be created
  + resource "cloudflare_dns_record" "this" {
      + content          = (known after apply)
      + created_on       = (known after apply)
      + id               = (known after apply)
      + meta             = (known after apply)
      + modified_on      = (known after apply)
      + name             = "malachowski.me"
      + proxiable        = (known after apply)
      + proxied          = false
      + settings         = (known after apply)
      + tags             = (known after apply)
      + tags_modified_on = (known after apply)
      + ttl              = 1
      + type             = "A"
      + zone_id          = "aff336ce5012d1e29eb613ba0ec54d9a"
    }

  # cloudflare_dns_record.wildcard will be created
  + resource "cloudflare_dns_record" "wildcard" {
      + content          = (known after apply)
      + created_on       = (known after apply)
      + id               = (known after apply)
      + meta             = (known after apply)
      + modified_on      = (known after apply)
      + name             = "*.malachowski.me"
      + proxiable        = (known after apply)
      + proxied          = false
      + settings         = (known after apply)
      + tags             = (known after apply)
      + tags_modified_on = (known after apply)
      + ttl              = 1
      + type             = "A"
      + zone_id          = "aff336ce5012d1e29eb613ba0ec54d9a"
    }

  # google_iam_workload_identity_pool.kubernetes will be created
  + resource "google_iam_workload_identity_pool" "kubernetes" {
      + description               = "Workload Identity Pool for Kubernetes cluster"
      + disabled                  = false
      + display_name              = "Kubernetes Workload Identity"
      + id                        = (known after apply)
      + name                      = (known after apply)
      + project                   = "malachowski"
      + state                     = (known after apply)
      + workload_identity_pool_id = "kubernetes-pool"
    }

  # google_iam_workload_identity_pool_provider.kubernetes_oidc will be created
  + resource "google_iam_workload_identity_pool_provider" "kubernetes_oidc" {
      + attribute_condition                = "assertion.sub.startsWith('system:serviceaccount:external-secrets:')"
      + attribute_mapping                  = {
          + "attribute.kubernetes_namespace" = "assertion['kubernetes.io'].namespace"
          + "attribute.kubernetes_pod"       = "assertion['kubernetes.io'].pod.name"
          + "attribute.kubernetes_sa"        = "assertion['kubernetes.io'].serviceaccount.name"
          + "google.subject"                 = "assertion.sub"
        }
      + description                        = "OIDC provider for Kubernetes service accounts"
      + disabled                           = false
      + display_name                       = "Kubernetes OIDC Provider"
      + id                                 = (known after apply)
      + name                               = (known after apply)
      + project                            = "malachowski"
      + state                              = (known after apply)
      + workload_identity_pool_id          = "kubernetes-pool"
      + workload_identity_pool_provider_id = "kubernetes-oidc-provider"

      + oidc {
          + issuer_uri = "https://oidc.malachowski.me"
        }
    }

  # google_project_iam_member.external_secrets_secret_accessor will be created
  + resource "google_project_iam_member" "external_secrets_secret_accessor" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:external-secrets-operator@malachowski.iam.gserviceaccount.com"
      + project = "malachowski"
      + role    = "roles/secretmanager.secretAccessor"
    }

  # google_service_account.external_secrets will be created
  + resource "google_service_account" "external_secrets" {
      + account_id   = "external-secrets-operator"
      + description  = "Service Account used by External Secrets Operator via Workload Identity Federation"
      + disabled     = false
      + display_name = "External Secrets Operator Service Account"
      + email        = "external-secrets-operator@malachowski.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:external-secrets-operator@malachowski.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "malachowski"
      + unique_id    = (known after apply)
    }

  # google_service_account_iam_member.workload_identity_binding will be created
  + resource "google_service_account_iam_member" "workload_identity_binding" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = (known after apply)
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

  # hcloud_load_balancer.this will be created
  + resource "hcloud_load_balancer" "this" {
      + delete_protection  = false
      + id                 = (known after apply)
      + ipv4               = (known after apply)
      + ipv6               = (known after apply)
      + labels             = (known after apply)
      + load_balancer_type = "lb11"
      + location           = "hel1"
      + name               = "prod-malachowski-me-lb"
      + network_id         = (known after apply)
      + network_ip         = (known after apply)
      + network_zone       = (known after apply)

      + algorithm (known after apply)

      + target (known after apply)
    }

  # hcloud_load_balancer_network.this will be created
  + resource "hcloud_load_balancer_network" "this" {
      + enable_public_interface = true
      + id                      = (known after apply)
      + ip                      = (known after apply)
      + load_balancer_id        = (known after apply)
      + network_id              = (known after apply)
    }

  # hcloud_load_balancer_service.this will be created
  + resource "hcloud_load_balancer_service" "this" {
      + destination_port = 6443
      + id               = (known after apply)
      + listen_port      = 6443
      + load_balancer_id = (known after apply)
      + protocol         = "tcp"
      + proxyprotocol    = (known after apply)

      + health_check (known after apply)

      + http (known after apply)
    }

  # hcloud_load_balancer_target.this will be created
  + resource "hcloud_load_balancer_target" "this" {
      + id               = (known after apply)
      + label_selector   = "role=control-plane"
      + load_balancer_id = (known after apply)
      + type             = "label_selector"
      + use_private_ip   = true
    }

  # helm_release.argocd will be created
  + resource "helm_release" "argocd" {
      + atomic                     = false
      + chart                      = "argo-cd"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "argocd"
      + namespace                  = "argocd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + verify                     = false
      + version                    = "7.7.11"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.external_secrets will be created
  + resource "helm_release" "external_secrets" {
      + atomic                     = false
      + chart                      = "external-secrets"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "external-secrets"
      + namespace                  = "external-secrets"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.external-secrets.io"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + values                     = [
          + <<-EOT
                "installCRDs": true
                "serviceAccount":
                  "create": false
                  "name": "external-secrets-operator"
            EOT,
        ]
      + verify                     = false
      + version                    = "1.3.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # kubectl_manifest.secret_store_gcp will be created
  + resource "kubectl_manifest" "secret_store_gcp" {
      + api_version             = "external-secrets.io/v1beta1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ClusterSecretStore"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "gcpsm-secret-store"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: external-secrets.io/v1beta1
            kind: ClusterSecretStore
            metadata:
              name: gcpsm-secret-store
            spec:
              provider:
                gcpsm:
                  auth:
                    workloadIdentity:
                      clusterLocation: eu
                      clusterName: prod.malachowski.me
                      serviceAccountRef:
                        name: external-secrets-operator
                        namespace: external-secrets
                  projectID: malachowski
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubernetes_config_map_v1.oidc_discovery will be created
  + resource "kubernetes_config_map_v1" "oidc_discovery" {
      + data = {
          + "openid-configuration" = jsonencode(
                {
                  + id_token_signing_alg_values_supported = [
                      + "RS256",
                    ]
                  + issuer                                = "https://oidc.malachowski.me"
                  + jwks_uri                              = "https://oidc.malachowski.me/openid/v1/jwks"
                  + response_types_supported              = [
                      + "id_token",
                    ]
                  + subject_types_supported               = [
                      + "public",
                    ]
                }
            )
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "oidc-discovery"
          + namespace        = "oidc-discovery"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_config_map_v1.oidc_nginx_config will be created
  + resource "kubernetes_config_map_v1" "oidc_nginx_config" {
      + data = {
          + "default.conf" = <<-EOT
                server {
                    listen 80;
                    server_name _;
                
                    location /.well-known/openid-configuration {
                        alias /usr/share/nginx/html/.well-known/openid-configuration;
                        add_header Content-Type application/json;
                        add_header Access-Control-Allow-Origin *;
                    }
                
                    location /openid/v1/jwks {
                        proxy_pass https://kubernetes.default.svc.cluster.local/openid/v1/jwks;
                        proxy_ssl_verify off;
                        proxy_set_header Host $host;
                        proxy_set_header X-Real-IP $remote_addr;
                        add_header Access-Control-Allow-Origin *;
                    }
                
                    location / {
                        return 404;
                    }
                }
            EOT
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "oidc-nginx-config"
          + namespace        = "oidc-discovery"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_deployment_v1.oidc_discovery will be created
  + resource "kubernetes_deployment_v1" "oidc_discovery" {
      + id               = (known after apply)
      + wait_for_rollout = true

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app" = "oidc-discovery"
            }
          + name             = "oidc-discovery"
          + namespace        = "oidc-discovery"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + min_ready_seconds         = 0
          + paused                    = false
          + progress_deadline_seconds = 600
          + replicas                  = "2"
          + revision_history_limit    = 10

          + selector {
              + match_labels = {
                  + "app" = "oidc-discovery"
                }
            }

          + strategy (known after apply)

          + template {
              + metadata {
                  + generation       = (known after apply)
                  + labels           = {
                      + "app" = "oidc-discovery"
                    }
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + uid              = (known after apply)
                }
              + spec {
                  + automount_service_account_token  = true
                  + dns_policy                       = "ClusterFirst"
                  + enable_service_links             = true
                  + host_ipc                         = false
                  + host_network                     = false
                  + host_pid                         = false
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  + restart_policy                   = "Always"
                  + scheduler

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

             - watch
            - apiGroups:
              - cilium.io
              resources:
              - ciliumnetworkpolicies
              - ciliumclusterwidenetworkpolicies
              verbs:
              - create
              - update
              - deletecollection
              - patch
              - get
              - list
              - watch
            - apiGroups:
              - cilium.io
              resources:
              - ciliumnetworkpolicies/status
              - ciliumclusterwidenetworkpolicies/status
              verbs:
              - patch
              - update
            - apiGroups:
              - cilium.io
              resources:
              - ciliumendpoints
              - ciliumidentities
              verbs:
              - delete
              - list
              - watch
            - apiGroups:
              - cilium.io
              resources:
              - ciliumidentities
              verbs:
              - update
            - apiGroups:
              - cilium.io
              resources:
              - ciliumnodes
              verbs:
              - create
              - update
              - get
              - list
              - watch
              - delete
            - apiGroups:
              - cilium.io
              resources:
              - ciliumnodes/status
              verbs:
              - update
            - apiGroups:
              - cilium.io
              resources:
              - ciliumendpointslices
              - ciliumenvoyconfigs
              - ciliumbgppeerconfigs
              - ciliumbgpadvertisements
              - ciliumbgpnodeconfigs
              verbs:
              - create
              - update
              - get
              - list
              - watch
              - delete
              - patch
            - apiGroups:
              - apiextensions.k8s.io
              resources:
              - customresourcedefinitions
              verbs:
              - create
              - get
              - list
              - watch
            - apiGroups:
              - apiextensions.k8s.io
              resourceNames:
              - ciliumloadbalancerippools.cilium.io
              - ciliumbgppeeringpolicies.cilium.io
              - ciliumbgpclusterconfigs.cilium.io
              - ciliumbgppeerconfigs.cilium.io
              - ciliumbgpadvertisements.cilium.io
              - ciliumbgpnodeconfigs.cilium.io
              - ciliumbgpnodeconfigoverrides.cilium.io
              - ciliumclusterwideenvoyconfigs.cilium.io
              - ciliumclusterwidenetworkpolicies.cilium.io
              - ciliumegressgatewaypolicies.cilium.io
              - ciliumendpoints.cilium.io
              - ciliumendpointslices.cilium.io
              - ciliumenvoyconfigs.cilium.io
              - ciliumexternalworkloads.cilium.io
              - ciliumidentities.cilium.io
              - ciliumlocalredirectpolicies.cilium.io
              - ciliumnetworkpolicies.cilium.io
              - ciliumnodes.cilium.io
              - ciliumnodeconfigs.cilium.io
              - ciliumcidrgroups.cilium.io
              - ciliuml2announcementpolicies.cilium.io
              - ciliumpodippools.cilium.io
              resources:
              - customresourcedefinitions
              verbs:
              - update
            - apiGroups:
              - cilium.io
              resources:
              - ciliumloadbalancerippools
              - ciliumpodippools
              - ciliumbgppeeringpolicies
              - ciliumbgpclusterconfigs
              - ciliumbgpnodeconfigoverrides
              verbs:
              - get
              - list
              - watch
            - apiGroups:
              - cilium.io
              resources:
              - ciliumpodippools
              verbs:
              - create
            - apiGroups:
              - cilium.io
              resources:
              - ciliumloadbalancerippools/status
              verbs:
              - patch
            - apiGroups:
              - coordination.k8s.io
              resources:
              - leases
              verbs:
              - create
              - get
              - update
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.talos.kubectl_manifest.apply_cilium["/apis/rbac.authorization.k8s.io/v1/namespaces/kube-system/rolebindings/cilium-config-agent"] will be created
  + resource "kubectl_manifest" "apply_cilium" {
      + api_version             = "rbac.authorization.k8s.io/v1"
      + apply_only              = true
      + field_manager           = "kubectl"
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "RoleBinding"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "cilium-config-agent"
      + namespace               = "kube-system"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: rbac.authorization.k8s.io/v1
            kind: RoleBinding
            metadata:
              labels:
                app.kubernetes.io/part-of: cilium
              name: cilium-config-agent
              namespace: kube-system
            roleRef:
              apiGroup: rbac.authorization.k8s.io
              kind: Role
              name: cilium-config-agent
            subjects:
            - kind: ServiceAccount
              name: cilium
              namespace: kube-system
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.talos.kubectl_manifest.apply_cilium["/apis/rbac.authorization.k8s.io/v1/namespaces/kube-system/roles/cilium-config-agent"] will be created
  + resource "kubectl_manifest" "apply_cilium" {
      + api_version             = "rbac.authorization.k8s.io/v1"
      + apply_only              = true
      + field_manager           = "kubectl"
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Role"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "cilium-config-agent"
      + namespace               = "kube-system"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: rbac.authorization.k8s.io/v1
            kind: Role
            metadata:
              labels:
                app.kubernetes.io/part-of: cilium
              name: cilium-config-agent
              namespace: kube-system
            rules:
            - apiGroups:
              - ""
              resources:
              - configmaps
              verbs:
              - get
              - list
              - watch
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.talos.kubectl_manifest.apply_hcloud_ccm["/api/v1/namespaces/kube-system/serviceaccounts/hcloud-cloud-controller-manager"] will be created
  + resource "kubectl_manifest" "apply_hcloud_ccm" {
      + api_version             = "v1"
      + apply_only              = true
      + field_manager           = "kubectl"
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ServiceAccount"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "hcloud-cloud-controller-manager"
      + namespace               = "kube-system"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: v1
            kind: ServiceAccount
            metadata:
              name: hcloud-cloud-controller-manager
              namespace: kube-system
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.talos.kubectl_manifest.apply_hcloud_ccm["/apis/apps/v1/namespaces/kube-system/deployments/hcloud-cloud-controller-manager"] will be created
  + resource "kubectl_manifest" "apply_hcloud_ccm" {
      + api_version             = "apps/v1"
      + apply_only              = true
      + field_manager           = "kubectl"
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Deployment"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "hcloud-cloud-controller-manager"
      + namespace               = "kube-system"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: apps/v1
            kind: Deployment
            metadata:
              name: hcloud-cloud-controller-manager
              namespace: kube-system
            spec:
              replicas: 1
              revisionHistoryLimit: 2
              selector:
                matchLabels:
                  app.kubernetes.io/instance: hcloud-cloud-controller-manager
                  app.kubernetes.io/name: hcloud-cloud-controller-manager
              template:
                metadata:
                  labels:
                    app.kubernetes.io/instance: hcloud-cloud-controller-manager
                    app.kubernetes.io/name: hcloud-cloud-controller-manager
                spec:
                  containers:
                  - args:
                    - --allow-untagged-cloud
                    - --cloud-provider=hcloud
                    - --feature-gates=CloudControllerManagerWatchBasedRoutesReconciliation=true
                    - --route-reconciliation-period=30s
                    - --webhook-secure-port=0
                    - --allocate-node-cidrs=true
                    - --cluster-cidr=10.0.16.0/20
                    - --leader-elect=false
                    env:
                    - name: HCLOUD_TOKEN
                      valueFrom:
                        secretKeyRef:
                          key: token
                          name: hcloud
                    - name: ROBOT_PASSWORD
                      valueFrom:
                        secretKeyRef:
                          key: robot-password
                          name: hcloud
                          optional: true
                    - name: ROBOT_USER
                      valueFrom:
                        secretKeyRef:
                          key: robot-user
                          name: hcloud
                          optional: true
                    - name: HCLOUD_NETWORK
                      valueFrom:
                        secretKeyRef:
                          key: network
                          name: hcloud
                    image: docker.io/hetznercloud/hcloud-cloud-controller-manager:v1.29.2
                    name: hcloud-cloud-controller-manager
                    ports:
                    - containerPort: 8233
                      name: metrics
                    resources:
                      requests:
                        cpu: 100m
                        memory: 50Mi
                  dnsPolicy: Default
                  hostNetwork: true
                  priorityClassName: system-cluster-critical
                  serviceAccountName: hcloud-cloud-controller-manager
                  tolerations:
                  - effect: NoSchedule
                    key: node.cloudprovider.kubernetes.io/uninitialized
                    value: "true"
                  - key: CriticalAddonsOnly
                    operator: Exists
                  - effect: NoSchedule
                    key: node-role.kubernetes.io/master
                    operator: Exists
                  - effect: NoSchedule
                    key: node-role.kubernetes.io/control-plane
                    operator: Exists
                  - effect: NoExecute
                    key: node.kubernetes.io/not-ready
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.talos.kubectl_manifest.apply_hcloud_ccm["/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/system:hcloud-cloud-controller-manager:restricted"] will be created
  + resource "kubectl_manifest" "apply_hcloud_ccm" {
      + api_version             = "rbac.authorization.k8s.io/v1"
      + apply_only              = true
      + field_manager           = "kubectl"
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ClusterRoleBinding"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "system:hcloud-cloud-controller-manager:restricted"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: rbac.authorization.k8s.io/v1
            kind: ClusterRoleBinding
            metadata:
              name: system:hcloud-cloud-controller-manager:restricted
            roleRef:
              apiGroup: rbac.authorization.k8s.io
              kind: ClusterRole
              name: system:hcloud-cloud-controller-manager
            subjects:
            - kind: ServiceAccount
              name: hcloud-cloud-controller-manager
              namespace: kube-system
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.talos.kubectl_manifest.apply_hcloud_ccm["/apis/rbac.authorization.k8s.io/v1/clusterroles/system:hcloud-cloud-controller-manager"] will be created
  + resource "kubectl_manifest" "apply_hcloud_ccm" {
      + api_version             = "rbac.authorization.k8s.io/v1"
      + apply_only              = true
      + field_manager           = "kubectl"
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ClusterRole"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "system:hcloud-cloud-controller-manager"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: rbac.authorization.k8s.io/v1
            kind: ClusterRole
            metadata:
              name: system:hcloud-cloud-controller-manager
            rules:
            - apiGroups:
              - ""
              resources:
              - configmaps
              verbs:
              - get
              - list
              - watch
            - apiGroups:
              - ""
              resources:
              - events
              verbs:
              - create
              - patch
              - update
            - apiGroups:
              - ""
              resources:
              - nodes
              verbs:
              - '*'
            - apiGroups:
              - ""
              resources:
              - nodes/status
              verbs:
              - patch
            - apiGroups:
              - ""
              resources:
              - services
              verbs:
              - list
              - watch
            - apiGroups:
              - ""
              resources:
              - services/status
              verbs:
              - patch
              - update
            - apiGroups:
              - ""
              resources:
              - serviceaccounts
              verbs:
              - create
            - apiGroups:
              - ""
              resources:
              - persistentvolumes
              verbs:
              - get
              - list
              - update
              - watch
            - apiGroups:
              - coordination.k8s.io
              resources:
              - leases
              verbs:
              - create
              - get
              - list
              - watch
              - update
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.talos.talos_cluster_kubeconfig.this[0] will be created
  + resource "talos_cluster_kubeconfig" "this" {
      + certificate_renewal_duration    = "720h"
      + client_configuration            = (known after apply)
      + endpoint                        = (known after apply)
      + id                              = (known after apply)
      + kubeconfig_raw                  = (sensitive value)
      + kubernetes_client_configuration = (known after apply)
      + node                            = (known after apply)
    }

  # module.talos.talos_machine_bootstrap.this[0] will be created
  + resource "talos_machine_bootstrap" "this" {
      + client_configuration = (known after apply)
      + endpoint             = (known after apply)
      + id                   = (known after apply)
      + node                 = (known after apply)
    }

  # module.talos.talos_machine_secrets.this will be created
  + resource "talos_machine_secrets" "this" {
      + client_configuration = (known after apply)
      + id                   = (known after apply)
      + machine_secrets      = (known after apply)
      + talos_version        = "v1.12.0"
    }

  # module.talos.tls_private_key.ssh_key[0] will be created
  + resource "tls_private_key" "ssh_key" {
      + algorithm                     = "ED25519"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 2048
    }

Plan: 57 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + kubeconfig = (sensitive value)

Warning: Check block assertion known after apply

  on .terraform/modules/talos/checks.tf line 3, in check "kubeconfig_endpoint_mode_requirements":
   3:     condition     = var.kubeconfig_endpoint_mode != "public_endpoint" || var.cluster_api_host != null
    ├────────────────
    │ var.cluster_api_host is a string
    │ var.kubeconfig_endpoint_mode is "public_endpoint"

The condition could not be evaluated at this time, a result will be known
when this plan is applied.
```

</details>



## :warning: Warnings

```hcl
Warning: Check block assertion known after apply

  on .terraform/modules/talos/checks.tf line 3, in check "kubeconfig_endpoint_mode_requirements":
   3:     condition     = var.kubeconfig_endpoint_mode != "public_endpoint" || var.cluster_api_host != null
    ├────────────────
    │ var.cluster_api_host is a string
    │ var.kubeconfig_endpoint_mode is "public_endpoint"

The condition could not be evaluated at this time, a result will be known
when this plan is applied.
```



<!-- github-comment: {"Command":"plan","JobName":"infra-plan","PRNumber":15,"Program":"tfcmt","SHA1":"f62ac4a1c61c4554058fa008b2c3bb510e974333","Vars":{},"WorkflowName":"infra-plan"} -->